#language:ru
@web-plugin
Функционал:

  @web-usual
  Сценарий:
    * пользователь находится на странице "Test Automation Gears"
    * пользователь (заполняет поле) "Search repositories..." "page-factory-2-example"
    * пользователь (кликает по ссылке) "page-factory-2-example"
    * пользователь находится на странице "Page-factory-2 example"
    * пользователь (выбирает ветку) "for-example"
    * пользователь (кликает по ссылке) "example.txt"
    * пользователь (проверяет значение) "Текстовое поле" "тестовый текст для проверки"




    * пользователь ждёт
